In [8]:
import pandas as pd

In [9]:
Patient = pd.read_excel(r"C:\analytics\data\Patient.xlsx")
Patient

   ID    Name  Age
0   1    Mike   22
1   2    Bili   35
2   3   Abram   40
3   4  Parker   25

In [10]:
DetailsP = pd.read_excel(r"C:\analytics\data\DetailsP.xlsx")
DetailsP

   ID City Gender
0   1   NY      M
1   2   KY      F
2   5   MD      M
3   6   VA      F

In [11]:
##inner join
pd.merge(Patient,DetailsP,on="ID", how="inner")

   ID  Name  Age City Gender
0   1  Mike   22   NY      M
1   2  Bili   35   KY      F

In [12]:
##left join
pd.merge(Patient,DetailsP,on="ID",how="left")

   ID    Name  Age City Gender
0   1    Mike   22   NY      M
1   2    Bili   35   KY      F
2   3   Abram   40  NaN    NaN
3   4  Parker   25  NaN    NaN

In [13]:
##right join
pd.merge(Patient,DetailsP,on="ID",how="right")

   ID  Name   Age City Gender
0   1  Mike  22.0   NY      M
1   2  Bili  35.0   KY      F
2   5   NaN   NaN   MD      M
3   6   NaN   NaN   VA      F

In [14]:
##outer join
pd.merge(Patient,DetailsP,on="ID",how="outer")

   ID    Name   Age City Gender
0   1    Mike  22.0   NY      M
1   2    Bili  35.0   KY      F
2   3   Abram  40.0  NaN    NaN
3   4  Parker  25.0  NaN    NaN
4   5     NaN   NaN   MD      M
5   6     NaN   NaN   VA      F

In [15]:
#cross join
Patient.assign(key=1).merge(DetailsP.assign(key=1))

   ID  Name  Age  key City Gender
0   1  Mike   22    1   NY      M
1   2  Bili   35    1   KY      F